'use strict'
const arr = ["245", "475", "3577", "4597", "1268", "7813", "2265"];

arr.forEach((e) => {
  if (e[0] == '2' || e[0] == '4') {
    console.log(e);
  }
});
 for (let i = 0; i < arr.length; i++) {  
  if (arr[i][0] === '2' || arr[i][0] == '4' ) {
    console.log(arr[i]);
  }
}; 

const arr1 = ["2", "3", "5", "7", "11", "13", "17", "19", "23", "29", "31", "37", 
"41", "43", "47", "53", "59", "61", "67", "71", "73", "79", "83", "89", "97"];

for (let i = 0; i < arr1.length; i++) {  
    console.log(`Делители ${arr1[i]} числа: 1 и ${arr1[i]}`);
  }; 